Revit 2027 API
Connector.IsConnectedTo Method
Identifies if the connector is connected to the specified connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsConnectedTo(
	Connector connector
)
Public Function IsConnectedTo (
	connector As Connector
) As Boolean
public:
bool IsConnectedTo(
	Connector^ connector
)
member IsConnectedTo :
        connector : Connector -> bool
Parameters
connector Connector
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument is null.
See Also
Reference
Connector Class
Autodesk.Revit.DB Namespace